PKS1C/src/Reports/ЗаработаноСотрудникомСверхурочка/ЗаработаноСотрудникомСверхурочка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЗаработаноСотрудникомСверхурочка</name>
</mdclass:Report>

PKS1C/src/InformationRegisters/ПочасовыеРаботы/ПочасовыеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочасовыеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Удаленка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сверхурочка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоставРабот</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкиКлиентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Reports/ЗаработаноСотрудникомСверхурочка/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ОтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.Месяц = ОткрытьФормуМодально("Обработка.ВыпадающийВыборПериода.Форма.Форма2"); 
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(ТабДок, Исполнитель, Месяц)	
	Макет = Отчеты.ЗаработаноСотрудникомСверхурочка.ПолучитьМакет("Макет");	
	ОбластьПараметры = Макет.ПолучитьОбласть("Параметры");	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");	
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	
	ОбластьПараметры.Параметры.Исполнитель = Исполнитель;
	ОбластьПараметры.Параметры.От = Формат(Месяц, "ДФ=""дд.ММ.гггг""");
	ОбластьПараметры.Параметры.До = Формат(КонецМесяца(Месяц), "ДФ=""дд.ММ.гггг""");
	
	ТабДок = Новый ТабличныйДокумент;
	
	ТабДок.Вывести(ОбластьПараметры);
	ТабДок.Вывести(ОбластьШапка);                   
	
	ЗапросРабот = Новый Запрос;
	ЗапросРабот.Текст = 
		"ВЫБРАТЬ
		|	ПочасовыеРаботы.Организация КАК Организация,
		|	ПочасовыеРаботы.Удаленка КАК Удаленка,
		|	ПочасовыеРаботы.Сверхурочка КАК Сверхурочка,
		|	ПочасовыеРаботы.Исполнитель КАК Исполнитель,
		|	ПочасовыеРаботы.ВремяПрибытия КАК ВремяПрибытия,
		|	ПочасовыеРаботы.ВремяЗавершения КАК ВремяЗавершения,
		|	ПочасовыеРаботы.СоставРабот КАК СоставРабот,
		|	ПочасовыеРаботы.ВремяЗатраты КАК ВремяЗатраты,
		|	ПочасовыеРаботы.Регистратор.Дата КАК Дата,
		|	ПочасовыеРаботы.Клиент КАК Клиент,
		|	ПочасовыеРаботы.Регистратор.Ссылка КАК РегистраторСсылка
		|ИЗ
		|	РегистрСведений.ПочасовыеРаботы КАК ПочасовыеРаботы
		|ГДЕ
		|	ПочасовыеРаботы.Исполнитель = &Исполнитель
		|	И ПочасовыеРаботы.Регистратор.Дата МЕЖДУ &От И &До
		|	И ПочасовыеРаботы.Сверхурочка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	ВремяПрибытия,
		|	ВремяЗавершения";
	
	ЗапросРабот.УстановитьПараметр("До", КонецМесяца(Месяц));
	ЗапросРабот.УстановитьПараметр("От", Месяц);
	ЗапросРабот.УстановитьПараметр("Исполнитель", Исполнитель);
	
	РезультатЗапросаРабот = ЗапросРабот.Выполнить();	
	ВыборкаРабот = РезультатЗапросаРабот.Выбрать();
	
	Если ВыборкаРабот.Количество() = 0 Тогда
		Сообщить("ОШИБКА! В выбраном месяце не было совершено ни одной работы");
		ТабДок.Вывести(ОбластьИтоги);
		Возврат;
	КонецЕсли;	
	
	ИтогСумма = 0;
	ИтогВремязатраты = 0;
	НомерРаботы = 1;
	
	Пока ВыборкаРабот.Следующий() Цикл
		Договор = Истина;
		ВыборкаЦен = ЗапросЦен(ВыборкаРабот.Организация, ВыборкаРабот.Дата); 	
		Если ВыборкаЦен.Количество() = 0 Тогда
			Сообщение = "ОШИБКА! С контрагенотом " + ВыборкаРабот.Организация + " к выбранному месяцу не был заключен договор обслуживания.";
			Сообщить(Сообщение);
			Договор = Ложь
		//ИначеЕсли ВыборкаЦен.АбонентскаяПлата Тогда
		//	Продолжить;
		КонецЕсли;
		ОбластьСтрока.Параметры.Дата = Формат(ВыборкаРабот.Дата, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.Организация = ВыборкаРабот.Организация;	
		ОбластьСтрока.Параметры.Клиент = ВыборкаРабот.Клиент;
		ОбластьСтрока.Параметры.ВремяПрибытия = Формат(ВыборкаРабот.ВремяПрибытия, "ДФ=""ЧЧ:мм:сс""");
		ОбластьСтрока.Параметры.ВремяЗавершения = Формат(ВыборкаРабот.ВремяЗавершения, "ДФ=""ЧЧ:мм:сс""");
		ОбластьСтрока.Параметры.Удаленка = ВыборкаРабот.Удаленка;
		ОбластьСтрока.Параметры.Сверхурочка = ВыборкаРабот.Сверхурочка;
		ОбластьСтрока.Параметры.СоставРабот = ВыборкаРабот.СоставРабот;
		ОбластьСтрока.Параметры.Времязатраты = ВыборкаРабот.ВремяЗатраты;
		ОбластьСтрока.Параметры.Документ = ВыборкаРабот.РегистраторСсылка;
		
		Если Договор Тогда
			ОбластьСтрока.Параметры.Абонентскаяплата = ВыборкаЦен.АбонентскаяПлата;			
			Если ВыборкаРабот.Сверхурочка И ВыборкаЦен.ТарифСверхурочный <> 0 Тогда
				ОбластьСтрока.Параметры.Тариф = ВыборкаЦен.ТарифСверхурочный;
				ОбластьСтрока.Параметры.Сумма = (ВыборкаЦен.ТарифСверхурочный * ВыборкаРабот.ВремяЗатраты) / 2;	
			Иначе 
				ОбластьСтрока.Параметры.Тариф = ВыборкаЦен.Тариф;
				Если ОбластьСтрока.Параметры.АбонентскаяПлата Тогда					
					ОбластьСтрока.Параметры.Сумма = (Цел( ПосчитатьТариф(ВыборкаРабот.Организация, ВыборкаРабот.Дата, Месяц, КонецМесяца(Месяц)) * ВыборкаРабот.ВремяЗатраты)  / 2 ) ;
				Иначе
					ОбластьСтрока.Параметры.Сумма = (ВыборкаЦен.Тариф * ВыборкаРабот.ВремяЗатраты) / 2;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ОбластьСтрока.Параметры.Абонентскаяплата = Ложь;
			ОбластьСтрока.Параметры.Тариф = 0;
			ОбластьСтрока.Параметры.Сумма = 0;
		КонецЕсли;
				
		ИтогСумма = ИтогСумма + ОбластьСтрока.Параметры.Сумма;
		ИтогВремязатраты = ИтогВремязатраты + ОбластьСтрока.Параметры.Времязатраты;
		ТабДок.Вывести(ОбластьСтрока);
		
		Если Не Договор Тогда
			Область= ТабДок.Область("R" + Строка(НомерРаботы + 5) + "C2:R" + Строка(НомерРаботы + 5) + "C13");
			Область.ЦветФона = WebЦвета.БледноКрасноФиолетовый;
		КонецЕсли;
		
		НомерРаботы = НомерРаботы + 1;
	КонецЦикла;

	ОбластьИтоги.Параметры.ИтогСумма = ИтогСумма;
	ОбластьИтоги.Параметры.ИтогВремязатраты = ИтогВремязатраты;
	ТабДок.Вывести(ОбластьИтоги);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)	
	СформироватьНаСервере(ТабДок, Исполнитель, Месяц);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Месяц = НачалоМесяца(ТекущаяДата());
	Исполнитель = ПолучитьИсполнителя();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИсполнителя(Пользователь=Неопределено)
	Если Пользователь = Неопределено Тогда
		Возврат ПользователиКлиентСервер.ТекущийПользователь().ФизическоеЛицо;
	Иначе
		Возврат ПользователиКлиентСервер.Пользователь.ФизическоеЛицо;
	КонецЕсли;
КонецФункции
